test/ab_10.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            80

Document Path:          /track?test0=987654321&count=1&test2=987654321&test3=987654321&test4=987654321&test5=987654321&test6=987654321&test7=987654321&test8=987654321&test9=987654321&test10=987654321&test11=987654321&test12=987654321&test13=987654321&test14=987654321&test15=987654321&test16=987654321&test17=987654321&test18=987654321&test19=987654321
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   41.265 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Total transferred:      7500000 bytes
HTML transferred:       0 bytes
Requests per second:    2423.34 [#/sec] (mean)
Time per request:       4.127 [ms] (mean)
Time per request:       0.413 [ms] (mean, across all concurrent requests)
Transfer rate:          177.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       1
Processing:     2    4   1.3      4      70
Waiting:        2    4   1.3      4      70
Total:          2    4   1.3      4      70

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      5
  95%      5
  98%      7
  99%      8
 100%     70 (longest request)