test/ab_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            80

Document Path:          /track?test0=987654321&count=1&test2=987654321&test3=987654321&test4=987654321&test5=987654321&test6=987654321&test7=987654321&test8=987654321&test9=987654321&test10=987654321&test11=987654321&test12=987654321&test13=987654321&test14=987654321&test15=987654321&test16=987654321&test17=987654321&test18=987654321&test19=987654321
Document Length:        0 bytes

Concurrency Level:      1000
Time taken for tests:   43.170 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Total transferred:      7500000 bytes
HTML transferred:       0 bytes
Requests per second:    2316.40 [#/sec] (mean)
Time per request:       431.704 [ms] (mean)
Time per request:       0.432 [ms] (mean, across all concurrent requests)
Transfer rate:          169.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.2      0     500
Processing:   147  428  56.7    414     938
Waiting:       88  425  47.3    413     907
Total:        147  428  56.8    414     938

Percentage of the requests served within a certain time (ms)
  50%    414
  66%    421
  75%    434
  80%    445
  90%    471
  95%    478
  98%    487
  99%    718
 100%    938 (longest request)